# Analzing Office Supply Data

## Import Python library for to analzing the data

In [1]:
## To load the data into pandas, 
## we must first import the packages that we’ll be using.

import pandas as pd
import numpy as np

#### Exploring the Data

In [2]:
# We can use pandas to read in the CSV file with the 'read_csv' method.

data = pd.read_csv('Desktop/OfficeSupplies.csv')

In [3]:
# The number of rows and columns to check how big our data.
# The 43 rows and 6 columns.
data.shape

(43, 6)

#### Analyzing the Data-Set

In [4]:
# Pandas takes the data and creates a DataFrame data structure.
# The 'head' function returns the top five rows.
data.head()

     OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99
1  12-Jul-2014     East     Nick   Binder     29        1.99
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49
3  29-Jul-2014     East    Susan   Binder     81       19.99
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95

In [5]:
# Call 'dtypes' attribute on the data frame to see what each column types.

data.dtypes

# Pandas using Numpy behind the scenes, 
# it interprets strings as objects.

OrderDate      object
Region         object
Rep            object
Item           object
Units           int64
Unit Price    float64
dtype: object

In [6]:
# Descriptive statistics on the data set and
# shows the statistics on the numerical columns.

data.describe()

           Units  Unit Price
count  43.000000   43.000000
mean   49.325581   20.308605
std    30.078248   47.345118
min     2.000000    1.290000
25%    27.500000    3.990000
50%    53.000000    4.990000
75%    74.500000   17.990000
max    96.000000  275.000000

1. Row count, which aligns to what the shape attribute showed us.
2. The mean, or average.
3. The standard deviation, or how spread out the data is.
4. The minimum and maximum value of each column
5. The number of items that fall within the first, second and third percentiles.

In [7]:
# To check if there are any missing values in the entire data set,
# we use the 'isnull' function.

data.isnull().values.any()

False

#### Lets do some operations for better analzing the data

###### 1. Who sold the most?

In [8]:
data.groupby(['Rep']).sum().sort_values('Units',ascending=True)

         Units  Unit Price
Rep
Thomas      89       21.98
Nick       125        6.98
James      142      299.97
Smith      156      141.29
Susan      170       55.97
Morgan     173       26.47
Rachel     183       10.26
Matthew    193      173.93
Bill       213       40.55
Alex       281       39.95
Richard    396       55.92

Richard sold the most units, but did he sell the most in dollar amount? Does selling the most units mean the rep earned the most money? How can we determine that if there’s no column available to find that out?

Pandas uses Numpy behind the scenes in the DataFrame object so it has the ability to do mathematical operations on columns, and it can do them quite fast.

In [9]:
data["Total Price"] = data["Units"] * data["Unit Price"]
data.head()

     OrderDate   Region      Rep     Item  Units  Unit Price  Total Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99       309.38
1  12-Jul-2014     East     Nick   Binder     29        1.99        57.71
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49       686.95
3  29-Jul-2014     East    Susan   Binder     81       19.99      1619.19
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95      1005.90

In [10]:
data.groupby("Rep").sum().sort_values("Total Price", ascending=False)
data.head()

     OrderDate   Region      Rep     Item  Units  Unit Price  Total Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99       309.38
1  12-Jul-2014     East     Nick   Binder     29        1.99        57.71
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49       686.95
3  29-Jul-2014     East    Susan   Binder     81       19.99      1619.19
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95      1005.90

We do the same grouping of the “Rep” column and sum up the values, but now we do a descending sort on the “Total Price” column values.

Richard may have sold the most units, but Matthew sold the most in terms of total price.

###### 2. What region sold the most?

In [11]:
group_by = data.groupby(['Region','Rep']).sum()
group_by

                 Units  Unit Price  Total Price
Region  Rep
Central Alex       281       39.95      2812.19
        Bill       213       40.55      1749.87
        Matthew    193      173.93      3109.44
        Morgan     173       26.47      1387.77
        Rachel     183       10.26       438.37
        Smith      156      141.29      1641.43
East    Nick       125        6.98       536.75
        Richard    396       55.92      2363.04
        Susan      170       55.97      3102.30
West    James      142      299.97      1283.61
        Thomas      89       21.98      1203.11

Group by two columns, “Region” and “Rep”, and sum those values up. With that result, we save it off into a new data frame.

In [12]:
total_price = group_by['Total Price'].groupby(level=0,group_keys=False)
total_price.head()

Region   Rep
Central  Alex       2812.19
         Bill       1749.87
         Matthew    3109.44
         Morgan     1387.77
         Rachel      438.37
East     Nick        536.75
         Richard    2363.04
         Susan      3102.30
West     James      1283.61
         Thomas     1203.11
Name: Total Price, dtype: float64

In [13]:
total_price.nlargest(5)

Region   Rep
Central  Matthew    3109.44
         Alex       2812.19
         Bill       1749.87
         Smith      1641.43
         Morgan     1387.77
East     Susan      3102.30
         Richard    2363.04
         Nick        536.75
West     James      1283.61
         Thomas     1203.11
Name: Total Price, dtype: float64